type IRegion = {
    [key in string]: {
        name: string
        boundedBy: number[][]
    }
}

const regionByISO: IRegion = {
    'RU-ALT': {
        name: 'Алтайский край',
        boundedBy: [
            [50.63997, 77.889406],
            [54.452993, 87.17062],
        ],
    },
    'RU-AMU': {
        name: 'Амурская обл',
        boundedBy: [
            [48.851748, 119.656144],
            [57.060759, 134.920407],
        ],
    },
    'RU-ARK': {
        name: 'Архангельская обл',
        boundedBy: [
            [60.635797, 35.370949],
            [67.5, 49.5],
        ],
    },
    'RU-AST': {
        name: 'Астраханская обл',
        boundedBy: [
            [45.055614, 44.960779],
            [48.863224, 49.811142],
        ],
    },
    'RU-BEL': {
        name: 'Белгородская обл',
        boundedBy: [
            [49.795893, 35.325162],
            [51.43075, 39.281243],
        ],
    },
    'RU-BRY': {
        name: 'Брянская обл',
        boundedBy: [
            [51.843729, 31.241878],
            [54.034241, 35.328333],
        ],
    },
    'RU-VLA': {
        name: 'Владимирская обл',
        boundedBy: [
            [55.104172, 38.268599],
            [56.812463, 42.97437],
        ],
    },
    'RU-VGG': {
        name: 'Волгоградская обл',
        boundedBy: [
            [47.44352, 41.170481],
            [51.247784, 47.432646],
        ],
    },
    'RU-VLG': {
        name: 'Вологодская обл',
        boundedBy: [
            [58.477616, 34.718107],
            [61.603707, 47.160124],
        ],
    },
    'RU-VOR': {
        name: 'Воронежская обл',
        boundedBy: [
            [49.556986, 38.137724],
            [52.103502, 42.947367],
        ],
    },
    'RU-YEV': {
        name: 'Еврейская Аобл',
        boundedBy: [
            [47.65305, 129.8],
            [49.494552, 134.997015],
        ],
    },
    'RU-ZAB': {
        name: 'Забайкальский край',
        boundedBy: [
            [49.155057, 108],
            [58.438733, 122.145744],
        ],
    },
    'RU-IVA': {
        name: 'Ивановская обл',
        boundedBy: [
            [56.352208, 39.374794],
            [57.739085, 43.305696],
        ],
    },
    'RU-IRK': {
        name: 'Иркутская обл',
        boundedBy: [
            [51.129857, 95.645173],
            [64.322017, 119.139388],
        ],
    },
    'RU-KB': {
        name: 'Кабардино-Балкарская Респ',
        boundedBy: [
            [42.889327, 42.39678],
            [44.021318, 44.474997],
        ],
    },
    'RU-KGD': {
        name: 'Калининградская обл',
        boundedBy: [
            [54.318209, 19.484764],
            [55.381311, 22.886621],
        ],
    },
    'RU-KLU': {
        name: 'Калужская обл',
        boundedBy: [
            [53.276996, 33.443443],
            [55.34967, 37.274838],
        ],
    },
    'RU-KAM': {
        name: 'Камчатский край',
        boundedBy: [
            [50.737927, 155.345985],
            [64.938645, 174.59531],
        ],
    },
    'RU-KC': {
        name: 'Карачаево-Черкесская Респ',
        boundedBy: [
            [43.188108, 40.675294],
            [44.498572, 42.681259],
        ],
    },
    'RU-KEM': {
        name: 'Кемеровская область - Кузбасс',
        boundedBy: [
            [52.162631, 85],
            [56.834796, 89.402565],
        ],
    },
    'RU-KIR': {
        name: 'Кировская обл',
        boundedBy: [
            [56.057996, 46.263614],
            [61.064932, 53.930637],
        ],
    },
    'RU-KOS': {
        name: 'Костромская обл',
        boundedBy: [
            [57.273672, 40.392486],
            [59.625172, 47.641729],
        ],
    },
    'RU-KDA': {
        name: 'Краснодарский край',
        boundedBy: [
            [43.250258, 36.52117],
            [47.03082, 41.740426],
        ],
    },
    'RU-KYA': {
        name: 'Красноярский край',
        boundedBy: [
            [51.772234, 73],
            [75, 118.144081],
        ],
    },
    'RU-KGN': {
        name: 'Курганская обл',
        boundedBy: [
            [54.187348, 61.96692],
            [56.843043, 68.723904],
        ],
    },
    'RU-KRS': {
        name: 'Курская обл',
        boundedBy: [
            [50.901727, 34.081435],
            [52.444612, 38.518933],
        ],
    },
    'RU-LEN': {
        name: 'Ленинградская обл',
        boundedBy: [
            [58.417086, 26.580233],
            [61.32976, 35.721417],
        ],
    },
    'RU-LIP': {
        name: 'Липецкая обл',
        boundedBy: [
            [51.887158, 37.721669],
            [53.587974, 40.765224],
        ],
    },
    'RU-MAG': {
        name: 'Магаданская обл',
        boundedBy: [
            [58.728779, 144.727755],
            [66.339345, 163.495574],
        ],
    },
    'RU-MOS': {
        name: 'Московская обл',
        boundedBy: [
            [54.255661, 35.144106],
            [56.958395, 40.204855],
        ],
    },
    'RU-MUR': {
        name: 'Мурманская обл',
        boundedBy: [
            [65.97011, 28.416677],
            [70.023974, 41.612659],
        ],
    },
    'RU-NIZ': {
        name: 'Нижегородская обл',
        boundedBy: [
            [54.461943, 41.776287],
            [58.091237, 47.771059],
        ],
    },
    'RU-NGR': {
        name: 'Новгородская обл',
        boundedBy: [
            [56.909598, 29.614598],
            [59.434405, 36.229217],
        ],
    },
    'RU-NVS': {
        name: 'Новосибирская обл',
        boundedBy: [
            [53.290638, 75.088432],
            [57.235356, 85.115975],
        ],
    },
    'RU-OMS': {
        name: 'Омская обл',
        boundedBy: [
            [53.43511, 70.357401],
            [58.575806, 76.305937],
        ],
    },
    'RU-ORE': {
        name: 'Оренбургская обл',
        boundedBy: [
            [50.494854, 50.7681],
            [54.365364, 61.690455],
        ],
    },
    'RU-ORL': {
        name: 'Орловская обл',
        boundedBy: [
            [51.934727, 34.793521],
            [53.652294, 38.065652],
        ],
    },
    'RU-PNZ': {
        name: 'Пензенская обл',
        boundedBy: [
            [52.291417, 42.082478],
            [54.029809, 46.981],
        ],
    },
    'RU-PER': {
        name: 'Пермский край',
        boundedBy: [
            [56.105239, 51.772326],
            [61.66299, 59.483537],
        ],
    },
    'RU-PRI': {
        name: 'Приморский край',
        boundedBy: [
            [42.139978, 130.394425],
            [48.464621, 139.196397],
        ],
    },
    'RU-PSK': {
        name: 'Псковская обл',
        boundedBy: [
            [55.589656, 27.325026],
            [59.021015, 31.516637],
        ],
    },
    'RU-AD': {
        name: 'Респ Адыгея',
        boundedBy: [
            [43.760127, 38.684753],
            [45.217682, 40.775699],
        ],
    },
    'RU-AL': {
        name: 'Респ Алтай',
        boundedBy: [
            [49.070793, 83.925716],
            [52.660009, 89.865862],
        ],
    },
    'RU-BA': {
        name: 'Респ Башкортостан',
        boundedBy: [
            [51.570524, 53.155732],
            [56.534093, 59.997571],
        ],
    },
    'RU-BU': {
        name: 'Респ Бурятия',
        boundedBy: [
            [49.960519, 98.629673],
            [57.249801, 116.921699],
        ],
    },
    'RU-DA': {
        name: 'Респ Дагестан',
        boundedBy: [
            [41.18599, 45.104357],
            [44.992518, 48.796477],
        ],
    },
    'RU-IN': {
        name: 'Респ Ингушетия',
        boundedBy: [
            [42.614957, 44.47735],
            [43.615848, 45.195383],
        ],
    },
    'RU-KL': {
        name: 'Респ Калмыкия',
        boundedBy: [
            [44.635381, 41.63535],
            [48.271596, 47.698278],
        ],
    },
    'RU-KR': {
        name: 'Респ Карелия',
        boundedBy: [
            [60.679619, 29.306108],
            [66.668638, 37.946517],
        ],
    },
    'RU-KO': {
        name: 'Респ Коми',
        boundedBy: [
            [59.198564, 45.399112],
            [68.423463, 66.251839],
        ],
    },
    'RU-ME': {
        name: 'Респ Марий Эл',
        boundedBy: [
            [55.824971, 45.624373],
            [57.343366, 50.201936],
        ],
    },
    'RU-MO': {
        name: 'Респ Мордовия',
        boundedBy: [
            [53.643482, 42.163928],
            [55.190138, 46.730145],
        ],
    },
    'RU-SA': {
        name: 'Респ Саха /Якутия/',
        boundedBy: [
            [55.486428, 100.509151],
            [76.164573, 162.855156],
        ],
    },
    'RU-SE': {
        name: 'Респ Северная Осетия - Алания',
        boundedBy: [
            [42.546997, 43.398132],
            [43.835188, 44.959629],
        ],
    },
    'RU-TA': {
        name: 'Респ Татарстан',
        boundedBy: [
            [53.974215, 47.259145],
            [56.674926, 54.266436],
        ],
    },
    'RU-TY': {
        name: 'Респ Тыва',
        boundedBy: [
            [49.742185, 88.7918],
            [53.729596, 99.273622],
        ],
    },
    'RU-KK': {
        name: 'Респ Хакасия',
        boundedBy: [
            [51.284196, 87.856573],
            [55.383884, 91.93611],
        ],
    },
    'RU-ROS': {
        name: 'Ростовская обл',
        boundedBy: [
            [45.951519, 38.220306],
            [50.214249, 44.324251],
        ],
    },
    'RU-RYA': {
        name: 'Рязанская обл',
        boundedBy: [
            [53.308795, 38.657247],
            [55.366231, 42.691239],
        ],
    },
    'RU-SAM': {
        name: 'Самарская обл',
        boundedBy: [
            [51.772736, 47.926989],
            [54.67877, 52.566599],
        ],
    },
    'RU-SAR': {
        name: 'Саратовская обл',
        boundedBy: [
            [49.801539, 42.504102],
            [52.818674, 50.830847],
        ],
    },
    'RU-SAK': {
        name: 'Сахалинская обл',
        boundedBy: [
            [43.183276, 141.002855],
            [54.544953, 156.718009],
        ],
    },
    'RU-SVE': {
        name: 'Свердловская обл',
        boundedBy: [
            [56.052205, 57.228325],
            [61.946507, 66.185732],
        ],
    },
    'RU-SMO': {
        name: 'Смоленская обл',
        boundedBy: [
            [53.413416, 30.750266],
            [56.06664, 35.390658],
        ],
    },
    'RU-STA': {
        name: 'Ставропольский край',
        boundedBy: [
            [43.658465, 40.843557],
            [46.237008, 45.715391],
        ],
    },
    'RU-TAM': {
        name: 'Тамбовская обл',
        boundedBy: [
            [51.587757, 39.917646],
            [53.82324, 43.249587],
        ],
    },
    'RU-TVE': {
        name: 'Тверская обл',
        boundedBy: [
            [55.631996, 30.760588],
            [58.863184, 38.326837],
        ],
    },
    'RU-TOM': {
        name: 'Томская обл',
        boundedBy: [
            [55.664314, 75.056658],
            [61.035304, 89.379227],
        ],
    },
    'RU-TUL': {
        name: 'Тульская обл',
        boundedBy: [
            [52.945878, 35.899994],
            [54.852381, 38.951229],
        ],
    },
    'RU-TYU': {
        name: 'Тюменская обл',
        boundedBy: [
            [53.74120385831582, 64.38815956249996],
            [61.31948403579298, 75.37448768749995],
        ],
    },
    'RU-UD': {
        name: 'Удмуртская Респ',
        boundedBy: [
            [55.85628, 51.124192],
            [58.545777, 54.434052],
        ],
    },
    'RU-ULY': {
        name: 'Ульяновская обл',
        boundedBy: [
            [52.532916, 45.797497],
            [54.890044, 50.243475],
        ],
    },
    'RU-KHA': {
        name: 'Хабаровский край',
        boundedBy: [
            [46.638575, 130.386188],
            [62.531913, 147.216502],
        ],
    },
    'RU-CHE': {
        name: 'Челябинская обл',
        boundedBy: [
            [51.990504, 57.131558],
            [56.367258, 63.351763],
        ],
    },
    'RU-CE': {
        name: 'Чеченская Респ',
        boundedBy: [
            [42.475618, 44.832284],
            [44.010057, 46.662925],
        ],
    },
    'RU-CU': {
        name: 'Чувашская республика - Чувашия',
        boundedBy: [
            [54.629716, 45.911331],
            [56.328693, 48.421494],
        ],
    },
    'RU-CHU': {
        name: 'Чукотский АО',
        boundedBy: [
            [61.724827, 157.729297],
            [71.677405, 191.128003],
        ],
    },
    'RU-YAR': {
        name: 'Ярославская обл',
        boundedBy: [
            [56.535368, 37.327291],
            [58.952451, 41.19479],
        ],
    },
    'RU-SPE': {
        name: 'г Санкт-Петербург',
        boundedBy: [
            [59.633711, 29.425108],
            [60.244809, 30.759528],
        ],
    },
    'RU-MOW': {
        name: 'г Москва',
        boundedBy: [
            [55.142221, 36.803259],
            [56.021281, 37.96779],
        ],
    },
    'RU-NEN': {
        name: 'Ненецкий АО',
        boundedBy: [
            [65.820407, 43.060348],
            [70.537372, 65.669776],
        ],
    },
    'RU-KHM': {
        name: 'Ханты-Мансийский Автономный округ - Югра',
        boundedBy: [
            [58.579676, 59.204753],
            [65.718074, 85.975771],
        ],
    },
    'RU-YAN': {
        name: 'Ямало-Ненецкий АО',
        boundedBy: [
            [62.19575, 62.000257],
            [73.580524, 86.007113],
        ],
    },
    'RU-SEV': {
        name: 'г Севастополь',
        boundedBy: [
            [44.207248, 33.198679],
            [44.959445, 33.897496],
        ],
    },
    'RU-KRY': {
        name: 'Респ Крым',
        boundedBy: [
            [44.20657, 32.299905],
            [46.229215, 36.752468],
        ],
    },
    'RU-LUG': {
        name: 'Луганская Народная респ',
        boundedBy: [
            [47.629852, 37.646848],
            [50.164358, 40.393430],
        ],
    },
    'RU-ZAP': {
        name: 'Запорожская обл',
        boundedBy: [
            [46.034418, 34.063732],
            [48.274283, 37.347991],
        ],
    },
    'RU-HER': {
        name: 'Херсонская обл',
        boundedBy: [
            [45.679617, 31.202262],
            [47.616173, 35.734122],
        ],
    },
    'RU-DON': {
        name: 'Донецкая Народная респ',
        boundedBy: [
            [46.676468, 36.437808],
            [49.258070, 39.184390],
        ],
    },
};

export default regionByISO;
